[]
=aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa

[MACROEDIT]
//編程主選單=
lb_GameDirectory_OME->Caption=選用遊戲
GameManagement=遊戲管理
GameManagement_Select=選用遊戲夾
GameManagement_New=新建遊戲夾
GameManagement_Modify=遊戲夾改名
GameManagement_Delete=刪除遊戲夾
FileManagement=匯入/匯出
FileManagement_New=新建宏
FileManagement_Open=打開宏
FileManagement_Save=保存宏
FileManagement_SaveAs=另存宏
FileManagement_Delete=刪除宏
FileManagement_ReName=重命名
FileManagement_Transfer=上傳/下載
lb_FileName_OME->Caption=檔名
//編程程式區=
rb_Loop_OME->Caption=迴圈
rb_Keyboard_OME->Caption=按鍵
rb_If_OME->Caption=如果
rb_Equal_OME->Caption=等於
lb_SRSectionReteatText1_OME->Caption=起始行
lb_SRSectionReteatText2_OME->Caption=~
lb_SRSectionReteatText3_OME->Caption=終止行,
lb_SRSectionReteatText4_OME->Caption=重覆次數
lb_SR_OME->Caption=~
lb_GotoText_OME->Caption=跳躍前往第
lb_LineText_OME->Caption=行
lb_KeyIfText_OME->Caption=如果
lb_KeyStateIsText_OME->Caption=的狀態是
lb_KeyThenGotoText_OME->Caption=就跳到第
lb_KeyLineText_OME->Caption=行
lb_IfText1_OME->Caption=如果
lb_IfThenGoto1_OME->Caption=就跳到第
lb_IfLineText1_OME->Caption=行
lb_IfText2_OME->Caption=如果
lb_IfThenGoto2_OME->Caption=就跳到第
lb_IfLineText2_OME->Caption=行
cb_Key_OME->Items->Strings[0]=按鍵1
cb_Key_OME->Items->Strings[1]=按鍵2
cb_Key_OME->Items->Strings[2]=按鍵3
cb_Key_OME->Items->Strings[3]=按鍵4
cb_Key_OME->Items->Strings[4]=按鍵5
cb_Key_OME->Items->Strings[5]=按鍵6
cb_Key_OME->Items->Strings[6]=按鍵7
cb_Key_OME->Items->Strings[7]=按鍵8
cb_Key_OME->Items->Strings[8]=按鍵9
cb_Key_OME->Items->Strings[9]=按鍵10
cb_Key_OME->Items->Strings[10]=按鍵11
cb_Key_OME->Items->Strings[11]=按鍵12
cb_Key_OME->Items->Strings[12]=按鍵13
cb_Key_OME->Items->Strings[13]=按鍵14
cb_Key_OME->Items->Strings[14]=按鍵15
cb_Key_OME->Items->Strings[15]=按鍵16
cb_Key_OME->Items->Strings[16]=按鍵17
cb_Key_OME->Items->Strings[17]=按鍵18
cb_Key_OME->Items->Strings[18]=按鍵19
cb_Key_OME->Items->Strings[19]=按鍵20
cb_Key_OME->Items->Strings[20]=按鍵21
cb_Key_OME->Items->Strings[21]=按鍵22
cb_Key_OME->Items->Strings[22]=按鍵23
cb_Key_OME->Items->Strings[23]=按鍵24
cb_KeyState_OME->Items->Strings[0]=按下
cb_KeyState_OME->Items->Strings[1]=未按下
cb_IfSign1_OME->Items->Strings[0]=等同
cb_IfSign1_OME->Items->Strings[1]=不等同
cb_IfSign2_OME->Items->Strings[0]=等同
cb_IfSign2_OME->Items->Strings[1]=不等同
Var->Items->Strings[0]=變數A
Var->Items->Strings[1]=變數B
Var->Items->Strings[2]=變數C
Var->Items->Strings[3]=變數D
//時間控制區=
lb_KeyDownAutoDelay_OME->Caption=按鍵按下,插入延遲
lb_KeyUpAutoDelay_OME->Caption=按鍵放開,插入延遲
lb_TimeUnit_OME->Caption=單位
cb_TimeType_OME->Items->Strings[0]=秒
cb_TimeType_OME->Items->Strings[1]=毫秒
cb_TimeType_OME->Items->Strings[2]=分
lb_Time_OME->Caption=時間
//滑鼠控制區=
lb_AbsPos_OME->Caption=滑鼠絕對移動座標(X,Y)
lb_AbsPos_OME->Hint=可以按住右邊的雷達圖標, 並移動到螢幕上任何位置, 來取得螢幕的座標
lb_RelativePos_OME->Caption=滑鼠相對移動座標(X,Y)
bt_WheelUp_OME->Caption=前滾
bt_WheelDown_OME->Caption=後滾
bt_MouseLeftKey_OME->Caption=左鍵
bt_MouseRightKey_OME->Caption=右鍵
bt_MouseMidKey_OME->Caption=中鍵
bt_Mouse4thKey_OME->Caption=四鍵
bt_Mouse5thKey_OME->Caption=五鍵
im_CursorPoint_OME->Hint=可以按住此雷達圖標, 並移動到螢幕上任何位置, 來取得螢幕的座標
//編程工具列=
rb_RepeatType_OME->Hint=不重複執行
rb_RepeatType1_OME->Hint=按下:執行@RETURN@彈起:終止執行
rb_RepeatType2_OME->Hint=按下:執行@RETURN@再按:終止執行
bt_Save_OME->Hint=儲存
bt_Undo_OME->Hint=還原
bt_Redo_OME->Hint=重做
bt_Cut_OME->Hint=剪下
bt_Copy_OME->Hint=複製
bt_Paste_OME->Hint=貼上
bt_MoveDown_OME->Hint=向下移動
bt_MoveUp_OME->Hint=向上移動
bt_Delete_OME->Hint=刪除
bt_Record_OME->Hint=錄製
//編程Popup視窗=
mi_Cut_OME->Caption=剪下
mi_CutSingleLine_OME->Caption=剪下單行
mi_CutMultiLine_OME->Caption=剪下多行
mi_Copy_OME->Caption=複製
mi_CopySingleLine_OME->Caption=複製單行
mi_CopyMultiLine_OME->Caption=複製多行
mi_Paste_OME->Caption=貼上
mi_MoveDown_OME->Caption=向下移動
mi_MoveUp_OME->Caption=向上移動
mi_Editline_OME->Caption=編輯此行
mi_Delete_OME->Caption=刪除
mi_DeleteSingleLine_OME->Caption=刪除單行
mi_DeleteMultiLine_OME->Caption=刪除多行
mi_ClearAllDelay_OME->Caption=清除所有 "延時"
mi_ClearAll_OME->Caption=全部清除
bt_ResumeMacroII_OME->Caption=返回 [奧斯卡II]
bt_DownloadExplain_OME->Caption=下載教程
GoWhile=第 %x 行至此行, 重複執行 %y 次
IfYes=如果 變數%x 等同 %y 就跳到第 %z 行
IfNo=如果 變數%x 不等同 %y 就跳到第 %z 行
IfYes2=如果 變數%x 等同 變數%y 就跳到第 %z 行
IfNo2=如果 變數%x 不等同 變數%y 就跳到第 %z 行
Equ=變數%x @equ@ %y
Equ2=變數%x @equ@ 變數%y
Equ3_0=變數%x @equ@ 變數%y + %z
Equ3_1=變數%x @equ@ 變數%y - %z
Equ3_2=變數%x @equ@ 變數%y & %z
Equ3_3=變數%x @equ@ 變數%y | %z
Equ3_4=變數%x @equ@ 變數%y ^ %z
Goto=前往第 %x 行
IfKeyDown=如果 按鍵 %x 的狀態是 "按住" 就跳到第 %y 行
IfKeyUp=如果 按鍵 %x 的狀態是 "未按住" 就跳到第 %y 行
Key=鍵
KeyDown=按下
KeyUp=彈起
MouseMoveTo=滑鼠移到
MouseRelativeMove=滑鼠相對移動
Delay=延時
millisecond=毫秒
second=秒
minute=分
MouseWhellUp=滾輪前滾
MouseWhellDown=滾輪後滾
MouseLeftKeyDown=左鍵按下
MouseLeftKeyUp=左鍵彈起
MouseLeftKeyClick=左鍵單擊
MouseLeftKeyDblClick=左鍵雙擊
MouseMiddleKeyDown=中鍵按下
MouseMiddleKeyUp=中鍵彈起
MouseMiddleKeyClick=中鍵單擊
MouseRightKeyDown=右鍵按下
MouseRightKeyUp=右鍵彈起
MouseRightKeyClick=右鍵單擊
MouseFourthKeyDown=四鍵按下
MouseFourthKeyUp=四鍵彈起
MouseFourthKeyClick=四鍵單擊
MouseFifthKeyDown=五鍵按下
MouseFifthKeyUp=五鍵彈起
MouseFifthKeyClick=五鍵單擊
PleaseInputMacroName=輸入檔名
SaveOK=儲存完成
MacroUsed=檔案/目錄已被應用至滑鼠記憶體中, 是否要刪除/重命名? 如選[是]該功能將移除!
GoWhileRangeError=插入的區間目前不存在
InputDigitError=請輸入數字!
VersionMessage=現為賞析版, 無法儲存修改資訊!
LoopLimit=巢狀迴圈不可超過3層
NullMacro=空白
PleaseCreateDirectory=請先建立遊戲資料夾!
DirectoryUsed=檔案/目錄已被應用至所有核心的滑鼠記憶體中, 是否要刪除/重命名? 如選[是]該功能將移除!
TrialAccessDeny=血手寶典賞析版!@RETURN@無法應用請購買特血核心3啟動碼@RETURN@(本軟體限用血手V或 R系列滑鼠!)
IsCoverSameNameFile=儲存的檔名有跟 [奧斯卡II] 同名，是否覆蓋同名檔案？
CPIRemarkDefault=預設
//按鍵測試區=
lb_MouseKeyTest_OME->Caption=按鍵查詢
PleasePressKey=請按下滑鼠按鍵
MouseKeyUnknown=無法辨識

[MACROEDIT_Record]
bt_Start->Caption=[F11] 開始
bt_Stop->Caption=[F12] 停止
cb_AxisAbsolute->Caption=錄製滑鼠絕對移動軌跡
cb_AxisRelatively->Caption=錄製滑鼠相對移動軌跡
cb_KeyboardAction->Caption=錄製鍵盤操作
cb_MouseClick->Caption=錄製滑鼠點擊
Script3=//下面是您錄製的編程!
Script4=//修改編程的方法有三種
Script5=//1. 藉由左方或下方的編輯面板來操作
Script6=//2. 直接在此作鍵盤輸入
Script7=//3. 使用上方的錄製功能, 錄製劇本

[MACROEDIT_Statement]
lb_Title->Caption=儲存前[功能註解]須填寫!
lb_Software->Caption=適用軟件
lb_Statement->Caption=功能說明
lb_Comment->Caption=動作描述
mi_EditerCut->Caption=剪下     Ctrl+X
mi_EditerCopy->Caption=複製     Ctrl+C
mi_EditerPaste->Caption=貼上     Ctrl+P
lb_EditComment->Caption1=填寫註解
lb_EditComment->Caption2=編輯註解
lb_Resolution->Caption=遊戲解析度
lb_CPIRemark->Caption=靈敏度

[MACROEDIT_Instructions]
lb_TestDescription->Caption=數據暫存于滑鼠第四鍵內存中，進入測試區或遊戲中測試，欲回復原第四鍵設定，請至[按鍵]頁重新設定
ck_CursorRecord->Caption=啟動光標錄製
lb_InterruptTips->Caption=測試編程無法停止時，則同時按下鍵盤[Caps Lock]、[Scroll Lock]、[Num Lock]鍵即可中斷功能，然後檢查編程
lb_TestCommon->Caption=測試說明
PressSpaceToTest=請按下第四鍵開始進行測試

[MACROEDIT_ShowIfMessage]
MacroExistAlready=檔案已存在，是否替換原檔案?
MacroModify=已修改, 要儲存嗎?
MacroNewCreate=是否建立新檔案?
MacroDeleteFile=是否刪除選定的檔案?
MacroSelectFile=檔案/目錄已被應用至滑鼠記憶體中, 是否要刪除/重命名? 如選[是]該功能將移除!
MacroDeleteDirectory=是否刪除此遊戲夾?@RETURN@目錄包含的檔案也將一併刪除!!
PleaseCreateDirectory=建立遊戲
InputNameExists=檔案已存在, 請更新檔案名!
MustCreatFile=必須新建宏檔案才可編輯!
InputNameInvalid=輸入名稱不正確! 存在特殊字元[ \ / : * ? " < > | ].

[MACROEDIT_InputBoxX]
lb_NewFileName->Caption=輸入檔名
lb_ReName->Caption1=重命名
lb_ReName->Caption2=新建宏檔案
lb_ReName->Caption3=新建遊戲夾
NewCreateGameName=新建遊戲夾
NewCreateFileName=新建檔案名

[MACROEDIT_Dialog]
lb_Directory->Caption=遊戲
lb_FileName->Caption=檔名
lb_Title->Caption1=新建宏
lb_Title->Caption2=打開宏
lb_Title->Caption3=保存宏
lb_Title->Caption4=另存宏
lb_Title->Caption5=刪除宏
lb_Title->Caption6=重命名
lb_FileType->Caption=類型：
advcb_FileType->Caption1=所有宏檔 *.*
advcb_FileType->Caption2=*.amc - 供按鍵區使用
advcb_FileType->Caption3=*.mgn - 宏槍格式供左鍵使用
NoAuthorityUse=權限不足，無法打開檔案

[MACROEDIT_SelectLine]
lb_SelectLineRange->Caption=選擇行數(範圍)

